Revit 2024 API
BuiltInFailures.RoofFailures.RoofCutoffRemoved Property
 The roof's cutoff failed and was removed; make sure the cutoff height is not below the roof.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RoofCutoffRemoved { get; }
Visual Basic
Public Shared ReadOnly Property RoofCutoffRemoved As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RoofCutoffRemoved {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace